In [1]:
import pandas as pd
import numpy as np
from utils import *

## Replication

### CRTSE

In [100]:
crtse = pd.read_excel("2018_2019_CRTSE_SummerSecondary_PGMT_4thyrBMT_ItemsRemoved.xls", sheet_name='Sheet1')

In [101]:
crtse = basic(crtse)

In [102]:
crtse = newColMean(crtse, "crtse_total", first="crtse_05", last="crtse_41")

In [104]:
crtse.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,crtse_05,crtse_06,crtse_07,crtse_08,crtse_09,...,crtse_25,crtse_27,crtse_28,crtse_30,crtse_31,crtse_33,crtse_35,crtse_36,crtse_41,crtse_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",96,98,91,71,92,...,77,100,100,100,62,100,88,83,100,87.888889

### DAS

In [105]:
das = pd.read_excel("2018_2019_DAS_SummerSecondary_PGMT_4thyrBMT_Recoded_Missing_ItemNamesRemoved.xls", sheet_name='Sheet1')

In [107]:
das = basic(das)

In [109]:
das = newColMean(das, "das_depression", included=["das_03", "das_05", "das_10", "das_13", "das_16", "das_17", "das_21"])
das = newColMean(das, "das_anxiety", included=["das_02", "das_04", "das_07", "das_09", "das_15", "das_19", "das_20"])
das = newColMean(das, "das_stress", included=["das_01", "das_06", "das_08", "das_11", "das_12", "das_14", "das_18"])

In [111]:
das.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,das_01,das_02,das_03,das_04,das_05,...,das_15,das_16,das_17,das_18,das_19,das_20,das_21,das_depression,das_anxiety,das_stress
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",3,2,1,0,0,...,1,0,3,0,0,2,0,1.0,1.0,1.428571

### Demographic Data

#### Importing and Saving Demog Data

In [129]:
demog = pd.read_excel("2018_2019_Demography_Survey_SummerSecondary_PGMT.xls", sheet_name="Sheet1")

In [130]:
demog = lowerSkip(demog)

In [296]:
demog.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,ccs_cohort,ccs_stutype,ccs_major,ccs_gpa,partch,...,hsses,hsrace,hsach,fustuses,fusturace,fustuach,futeases,futearace,futeaach,q37
1,2018-06-08 08:00:42,2273117.0,Alba,Elena,"McGraw,Jillian",1,2,American Studies and Religious Studies,3.86,1,...,2,2,3,2,2,3,2,2,3,"I chose UVA for a variety of reasons, includin..."

#### Importing and saving data from 2017-2018 for missing data

In [133]:
miss = pd.read_excel("2017_2018_CCS1_DemographySurvey_NumID_NoConsentRemoved.xlsx")

In [135]:
miss = lowerSkip(miss)

In [297]:
miss.head(1)

,assessed,student,recipientlastname,recipientfirstname,ccs_cohort,ccs_stutype,ccs_major,ccs_gpa,partch,moedu,...,hsloc,hsses,hsrace,hsach,fustuses,fusturace,fustuach,futeases,futearace,futeaach
1,2017-09-14 05:05:54,2539029.0,All,Hannah,3,1,Art History,3.5,1,4,...,1,3,2,2,2,2,2,2,2,2

#### Append the datasets

In [269]:
merged = mergeData(demog, miss)

In [271]:
merged = basic(merged)

In [ ]:
merged = dates(merged)

In [278]:
merged = merged.query("student != 2176293 | assessed != '09162017'")

In [280]:
merged.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,ccs_cohort,ccs_stutype,ccs_major,ccs_gpa,partch,...,hsses,hsrace,hsach,fustuses,fusturace,fustuach,futeases,futearace,futeaach,q37
0,06082018,2273117.0,Alba,Elena,"McGraw,Jillian",1,2,American Studies and Religious Studies,3.86,1,...,2,2,3,2,2,3,2,2,3,"I chose UVA for a variety of reasons, includin..."

### FIT

In [281]:
fit = pd.read_excel("2018_2019_FIT_SummerSecondary_PGMT_4thyrBMT_Recoded_ItemNamesRemoved.xls", sheet_name="Sheet1")

In [282]:
fit = basic(fit)

In [283]:
fit = newColMean(fit, "fit_total", first="fit_01", last="fit_13")

In [289]:
fit.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,fit_01,fit_04,fit_05,fit_06,fit_07,fit_08,fit_09,fit_10,fit_11,fit_12,fit_13,fit_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",5,5,1,5,7,7,7,2,1,4,7,4.636364

### GRIT

In [285]:
grit = pd.read_excel("2018_2019_GRIT_SummerSecondary_PGMT_4thyrBMT_ReverseCoded_OrigRemoved.xls", sheet_name="Sheet1")

In [286]:
grit = basic(grit)

In [287]:
grit = newColMean(grit, "grit_total", first="r_grit_02", last="r_grit_11")

In [290]:
grit.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,r_grit_02,grit_04,r_grit_05,grit_06,r_grit_07,r_grit_08,grit_09,grit_12,grit_01,r_grit_03,grit_10,r_grit_11,grit_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",2,1,1,1,3,2,1,1,1,3,1,5,1.833333

### IMTS

In [291]:
imts = pd.read_excel("2018_2019_IMTS_SummerSecondary_PGMT_4thyrBMT_Missing_ItemNamesRemoved.xls", sheet_name="Sheet1")

In [292]:
imts = basic(imts)

In [293]:
imts = newColMean(imts, "imts_total", first="imts_01", last="imts_05")

In [295]:
imts.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,imts_01,imts_02,imts_03,imts_04,imts_05,imts_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",5,4,4,3,4,4.0

### NEO

#### Importing Neo

In [351]:
neo = pd.read_excel("2018_2019_NEO_SummerSecondary_PGMT_ReverseCoded_OrigRemoved.xls", sheet_name="Sheet1")

In [352]:
neo = lowerSkip(neo)

In [353]:
neo = basic(neo)

In [354]:
neo.r_neo_01.dtypes

dtype('float64')

In [355]:
neo.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,r_neo_01,neo_02,r_neo_03,neo_04,neo_05,...,neo_51,neo_52,neo_53,r_neo_54,r_neo_55,neo_56,r_neo_57,neo_58,r_neo_59,neo_60
1,2018-06-08 08:00:42,2273117.0,Alba,Elena,"McGraw,Jillian",4.0,4,4.0,5,4,...,2,5,5,4.0,4.0,3,2.0,3,4.0,5

#### Importing Contact List

In [356]:
contact = pd.read_excel("Student_Contact_2018_2019.xls")

In [357]:
contact.head(1)

,student,name,universitycomputingid,studentacademicyr,email
0,2273117,"Alba,Elena M",ema4ex,NaN,ema4ex@virginia.edu

#### Merge Neo and Contact List

In [358]:
neo_merged = neo.merge(contact, on='student', how='left')

In [359]:
neo_merged = neo_merged.drop(['name', 'universitycomputingid', 'studentacademicyr'], axis=1)

In [417]:
neo_merged.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,r_neo_01,neo_02,r_neo_03,neo_04,neo_05,...,neo_52,neo_53,r_neo_54,r_neo_55,neo_56,r_neo_57,neo_58,r_neo_59,neo_60,email
0,2018-06-08 08:00:42,2273117.0,Alba,Elena,"McGraw,Jillian",4.0,4,4.0,5,4,...,5,5,4.0,4.0,3,2.0,3,4.0,5,ema4ex@virginia.edu

#### Import 2017 Data

In [361]:
neo_2017 = pd.read_excel("NEO 2017 09 27.xlsx")

In [362]:
neo_2017 = lowerSkip(neo_2017)

In [363]:
neo_2017 = neo_2017.rename({"recipientemail":"email"}, axis=1)

In [364]:
neo_2017 = neo_2017.sort_values(by='recipientfirstname', ascending=True)

In [416]:
neo_2017.head(1)

,recipientlastname,recipientfirstname,email,neo_1,neo_2,neo_3,neo_4,neo_5,neo_6,neo_7,...,neo_51,neo_52,neo_53,neo_54,neo_55,neo_56,neo_57,neo_58,neo_59,neo_60
29,Copley,Abigail,ac4ah@virginia.edu,3,2,4,4,4,2,3,...,2,4,4,3,2,3,2,4,3,4

#### Merging with contact list to get student numbers

In [366]:
neo_2017_merged = neo_2017.merge(contact, on='email', how='outer')

In [367]:
neo_2017_merged = neo_2017_merged.drop(['name', 'universitycomputingid', 'studentacademicyr'], axis=1)

In [368]:
neo_2017_merged = basic(neo_2017_merged)

In [369]:
neo_2017_merged.head(1)

,recipientlastname,recipientfirstname,email,neo_1,neo_2,neo_3,neo_4,neo_5,neo_6,neo_7,...,neo_52,neo_53,neo_54,neo_55,neo_56,neo_57,neo_58,neo_59,neo_60,student
0,Copley,Abigail,ac4ah@virginia.edu,3,2,4,4,4,2,3,...,4,4,3,2,3,2,4,3,4,2598400.0

#### Reverse coding management approaches scale

In [370]:
neo_2017_merged = destring(neo_2017_merged, first="neo_1", last="neo_60")

In [372]:
include = ["neo_1", "neo_3", "neo_8", "neo_9", "neo_12", "neo_14", "neo_15", "neo_16", "neo_18", "neo_23", \
           "neo_24", "neo_27", "neo_29", "neo_30", "neo_31", "neo_33", "neo_38", "neo_39", "neo_42", \
           "neo_44", "neo_45", "neo_46", "neo_48", "neo_54", "neo_55", "neo_57", "neo_59"]
neo_2017_merged = recode(neo_2017_merged, include)

In [373]:
neo_2017_merged = neo_2017_merged.rename({"r_neo_1": "r_neo_01",
                                         "neo_2": "neo_02",
                                         "r_neo_3": "r_neo_03",
                                         "neo_4": "neo_04",
                                         "neo_5": "neo_05",
                                         "neo_6": "neo_06",
                                         "neo_7": "neo_07",
                                         "r_neo_8": "r_neo_08",
                                         "r_neo_9": "r_neo_09"}, axis=1)

In [375]:
neo_2017_merged = neo_2017_merged.dropna(subset=['r_neo_01'])

In [377]:
neo_2017_merged.head(1)

,recipientlastname,recipientfirstname,email,neo_02,neo_04,neo_05,neo_06,neo_07,neo_10,neo_11,...,r_neo_39,r_neo_42,r_neo_44,r_neo_45,r_neo_46,r_neo_48,r_neo_54,r_neo_55,r_neo_57,r_neo_59
0,Copley,Abigail,ac4ah@virginia.edu,2.0,4.0,4.0,2.0,3.0,4.0,3.0,...,4.0,4.0,3.0,4.0,3.0,4.0,3.0,4.0,4.0,3.0

#### Appending datasets

Note: "2018_2019_NEO1_Data.dta" is the dataframe neo_merged above

In [379]:
appended = mergeData(neo_2017_merged, neo_merged)

In [384]:
# create column with how many times student occurs
appended['Count'] = appended.groupby('student')['student'].transform('count')

In [387]:
appended = appended.query("Count==1 | email != '' ")

In [389]:
appended = appended.drop(['Count'], axis=1)

In [391]:
appended = newColMean(appended, "neo_n", included=["r_neo_01", "neo_06", "neo_11", "r_neo_16", \
                                          "neo_21", "neo_26", "r_neo_31", "neo_36", "neo_41", \
                                          "r_neo_46", "neo_51", "neo_56"])

In [393]:
appended = newColMean(appended, "neo_e", included=["neo_02", "neo_07", "r_neo_12", "neo_17", \
                                                   "neo_22", "r_neo_27", "neo_32", "neo_37", \
                                                   "r_neo_42", "neo_47", "neo_52", "r_neo_57"])

In [394]:
appended = newColMean(appended, "neo_o", included=["r_neo_03", "r_neo_08", "neo_13", "r_neo_18", \
                                                   "r_neo_23", "neo_28", "r_neo_33", "r_neo_38", \
                                                   "neo_43", "r_neo_48", "neo_53", "neo_58"])

In [395]:
appended = newColMean(appended, "neo_a", included=["neo_04", "r_neo_09", "r_neo_14", "neo_19", \
                                                   "r_neo_24", "r_neo_29", "neo_34", "r_neo_39", \
                                                   "r_neo_44", "neo_49", "r_neo_54", "r_neo_59"])

In [396]:
appended = newColMean(appended, "neo_c", included=["neo_05", "neo_10", "r_neo_15", "neo_20", "neo_25", \
                                                   "r_neo_30", "neo_35", "neo_40", "r_neo_45", "neo_50", \
                                                   "r_neo_55", "neo_60"])

In [398]:
appended.head(1)

,recipientlastname,recipientfirstname,email,neo_02,neo_04,neo_05,neo_06,neo_07,neo_10,neo_11,...,r_neo_55,r_neo_57,r_neo_59,assessed,assessor,neo_n,neo_e,neo_o,neo_a,neo_c
0,Copley,Abigail,ac4ah@virginia.edu,2,4,4,2,3,4,3,...,4.0,4.0,3.0,NaN,NaN,2.666667,3.416667,3.333333,3.583333,3.583333

#### Merging with missing data to update

In [399]:
missing = pd.read_excel("2018_2019_NEO_Missing.xls")

In [401]:
missing.columns = missing.columns.str.lower()

In [403]:
missing = newColMean(missing, "neo_n", included=["r_neo_01", "neo_06", "neo_11", "r_neo_16", \
                                          "neo_21", "neo_26", "r_neo_31", "neo_36", "neo_41", \
                                          "r_neo_46", "neo_51", "neo_56"])

In [404]:
missing = newColMean(missing, "neo_e", included=["neo_02", "neo_07", "r_neo_12", "neo_17", \
                                                   "neo_22", "r_neo_27", "neo_32", "neo_37", \
                                                   "r_neo_42", "neo_47", "neo_52", "r_neo_57"])

In [405]:
missing = newColMean(missing, "neo_o", included=["r_neo_03", "r_neo_08", "neo_13", "r_neo_18", \
                                                   "r_neo_23", "neo_28", "r_neo_33", "r_neo_38", \
                                                   "neo_43", "r_neo_48", "neo_53", "neo_58"])

In [406]:
missing = newColMean(missing, "neo_a", included=["neo_04", "r_neo_09", "r_neo_14", "neo_19", \
                                                   "r_neo_24", "r_neo_29", "neo_34", "r_neo_39", \
                                                   "r_neo_44", "neo_49", "r_neo_54", "r_neo_59"])

In [407]:
missing = newColMean(missing, "neo_c", included=["neo_05", "neo_10", "r_neo_15", "neo_20", "neo_25", \
                                                   "r_neo_30", "neo_35", "neo_40", "r_neo_45", "neo_50", \
                                                   "r_neo_55", "neo_60"])

In [408]:
missing = missing.drop(['assessed', 'assessor'], axis=1)

In [410]:
missing.head(1)

,name,email,program,section,student,recipientlastname,recipientfirstname,r_neo_01,neo_02,r_neo_03,...,neo_56,r_neo_57,neo_58,r_neo_59,neo_60,neo_n,neo_e,neo_o,neo_a,neo_c
0,"Atkeson,Kate",kra2fn@virginia.edu,elementary,Monday,2542858.0,Atkeson,Katherine,4.0,3.0,4.0,...,2.0,3.0,3.0,4.0,3.0,2.916667,3.833333,4.0,4.5,3.666667

#### Merging Two Datasets

In [413]:
# "2018_2019_NEO_Data.dta" is stored as the dataframe "appended"
# "2018_2019_NEO_Missing_Cleaned.dta" is stored as the dataframe "missing"
# this df final_neo becomes "2018_2019_NEO_Data.dta"
final_neo = appended.merge(missing[['student', 'name', 'program', 'section']], on='student', how='outer')

In [415]:
final_neo.head(1)

,recipientlastname,recipientfirstname,email,neo_02,neo_04,neo_05,neo_06,neo_07,neo_10,neo_11,...,assessed,assessor,neo_n,neo_e,neo_o,neo_a,neo_c,name,program,section
0,Copley,Abigail,ac4ah@virginia.edu,2,4,4,2,3,4,3,...,NaN,NaN,2.666667,3.416667,3.333333,3.583333,3.583333,NaN,NaN,NaN

### RSQ

In [491]:
rsq = pd.read_excel("2018_2019_RSQ_SummerSecondary_PGMT_ReverseCoded_OrigRemoved.xls", sheet_name="Sheet1")

In [492]:
rsq.columns = rsq.columns.str.lower()

In [499]:
rsq.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,r_rsq_01,rsq_03,r_rsq_05,r_rsq_07,rsq_10,...,r_rsq_13,r_rsq_17,r_rsq_20,r_rsq_21,r_rsq_23,r_rsq_24,rsq_27,r_rsq_28,r_rsq_29,rsq_30
0,2018-06-08 08:00:42,2273117.0,Alba,Elena,"McGraw,Jillian",2,4,4,2,2,...,3,4,3,2,2,4,3,5,4,4

In [494]:
rsq2 = pd.read_excel("2018_2019_RSQ_Missing.xlsx")

In [495]:
rsq2.columns = rsq2.columns.str.lower()

In [500]:
rsq2.head(1)

,name,email,program,section,assessed,student,recipientlastname,recipientfirstname,assessor,r_rsq_01,...,r_rsq_13,r_rsq_17,r_rsq_20,r_rsq_21,r_rsq_23,r_rsq_24,rsq_27,r_rsq_28,r_rsq_29,rsq_30
0,"All,Hannah",haa8kt@virginia.edu,elementary,Monday,2017-09-14 05:05:54,2539029.0,All,Hannah,"McGraw, Jillian",5.0,...,5.0,5.0,5.0,5.0,5.0,5.0,5.0,2.0,5.0,4.0

In [497]:
allRSQ = mergeData(rsq2, rsq)

In [501]:
allRSQ.loc[allRSQ.name=="Gross,Hannah","student"] = 2603880

In [502]:
allRSQ = basic(allRSQ)

In [503]:
allRSQ = newColMean(allRSQ, "rsq_total", first="r_rsq_01", last="rsq_30")

/Users/jmachita03/opt/anaconda3/lib/python3.7/site-packages/ipykernel_launcher.py:8: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

In [505]:
allRSQ.head(1)

,name,email,program,section,assessed,student,recipientlastname,recipientfirstname,assessor,r_rsq_01,...,r_rsq_17,r_rsq_20,r_rsq_21,r_rsq_23,r_rsq_24,rsq_27,r_rsq_28,r_rsq_29,rsq_30,rsq_total
0,"All,Hannah",haa8kt@virginia.edu,elementary,Monday,2017-09-14 05:05:54,2539029.0,All,Hannah,"McGraw, Jillian",5.0,...,5.0,5.0,5.0,5.0,5.0,5.0,2.0,5.0,4.0,4.705882

### TMAS

In [425]:
tmas = pd.read_excel("2018_2019_TMAS_SummerSecondary_PGMT_4thyrBMT_Missing_ReverseCoded_OrigRemoved_ItemNamesRemoved.xls", sheet_name="Sheet1")

In [426]:
tmas = basic(tmas)

In [427]:
tmas = newColMean(tmas, "tmas_total", first="tmas_01", last="r_tmas_20")

In [431]:
tmas.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,tmas_01,tmas_02,r_tmas_03,tmas_04,r_tmas_06,...,r_tmas_12,tmas_13,tmas_14,r_tmas_15,r_tmas_16,tmas_17,tmas_18,r_tmas_19,r_tmas_20,tmas_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",5,5,5,5,5,...,5,5,5,5,1,5,5,5,5,4.647059

### TSE

In [432]:
tse = pd.read_excel("2018_2019_TSE_SummerSecondary_PGMT_4thyrBMT.xls", sheet_name="Sheet1")

In [433]:
tse = basic(tse)

In [434]:
tse = newColMean(tse, "tses_se", included=["tse_01", "tse_02", "tse_04", "tse_06", "tse_09", "tse_12", "tse_14", "tse_22"])

In [435]:
tse = newColMean(tse, "tses_is", included=["tse_07", "tse_10", "tse_11", "tse_17", "tse_18", "tse_20", "tse_23", "tse_24"])

In [436]:
tse = newColMean(tse, "tses_cm", included=["tse_03", "tse_05", "tse_08", "tse_13", "tse_15", "tse_16", "tse_19", "tse_21"])

In [437]:
tse = newColMean(tse, "tses_total", included=["tse_01", "tse_02", "tse_04", "tse_06", "tse_09", "tse_12", \
                                              "tse_14", "tse_22", "tse_07", "tse_10", "tse_11", "tse_17", \
                                              "tse_18", "tse_20", "tse_23", "tse_24", "tse_03", "tse_05", \
                                              "tse_08", "tse_13", "tse_15", "tse_16", "tse_19", "tse_21"])

In [439]:
tse.head(1)

,assessed,student,recipientlastname,recipientfirstname,assessor,tse_03,tse_04,tse_15,tse_09,tse_11,...,tse_12,tse_14,tse_17,tse_19,tse_21,tse_24,tses_se,tses_is,tses_cm,tses_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",8,8,8,9,8,...,9,8,8,8,8,8,8.125,8.25,8.0,8.125

### YTRT

In [440]:
ytrt = pd.read_excel("2018_2019_YTRT_SummerSecondary_PGMT_4thyrBMT_Missing_ItemNamesRemoved.xls", sheet_name="Sheet1")

In [441]:
ytrt = basic(ytrt)

In [442]:
ytrt = newColMean(ytrt, "ytrt_total", first="ytrt_01", last="ytrt_05")

In [443]:
ytrt

,assessed,student,recipientlastname,recipientfirstname,assessor,ytrt_01,ytrt_02,ytrt_03,ytrt_04,ytrt_05,ytrt_total
0,2018-06-08 07:58:12,2561224.0,Kim,Yewon,"McGraw,Jillian",4,1,7,6,5,4.6
1,2018-06-08 08:12:14,2273117.0,Alba,Elena,"McGraw,Jillian",6,6,7,7,6,6.4
2,2018-09-14 16:41:02,2539029.0,All,Hannah,"McGraw,Jillian",6,7,7,6,7,6.6
3,2018-09-26 18:07:25,2745617.0,Appleton,Megan,"McGraw,Jillian",6,4,6,6,6,5.6
4,2018-10-10 19:55:37,2542858.0,Atkeson,Katherine,"McGraw,Jillian",6,6,7,5,6,6.0
...,...,...,...,...,...,...,...,...,...,...,...
113,2018-09-24 12:02:15,2635681.0,Winkler,Lily,"McGraw,Jillian",6,6,6,7,7,6.4
114,2018-06-08 08:12:35,2485660.0,Wright,Joseph,"McGraw,Jillian",5,4,6,6,6,5.4
115,2018-09-13 17:41:02,2592977.0,Xin,Christie,"McGraw,Jillian",7,7,7,7,1,5.8
116,2018-06-09 09:18:58,2524000.0,Yancey,Katherine,"McGraw,Jillian",7,6,7,7,7,6.8
117,2018-10-10 11:21:51,2543571.0,Yang,Hannah,"McGraw,Jillian",7,7,7,7,7,7.0

## Merging All Datasets

In [537]:
full = ytrt[['student', 'ytrt_total', 'recipientlastname', 'recipientfirstname']]

In [538]:
full = full.merge(crtse[['student', 'crtse_total']], on='student', how='outer')

In [539]:
full = full.merge(das[['student', 'das_depression', 'das_anxiety', 'das_stress']], on='student', how='outer')

In [540]:
keep = list(demog.loc[:, 'ccs_gpa':'hsach'].columns)
keep.append('student')
full = full.merge(demog[keep], on='student', how='left')

## ERROR in stata: variable student does not uniquely identify observations in the using data

In [541]:
full = full.merge(fit[['student', 'fit_total']], on='student', how='outer')

In [542]:
full = full.merge(grit[['student', 'grit_total']], on='student', how='outer')

In [543]:
full = full.merge(imts[['student', 'imts_total']], on='student', how='outer')

In [544]:
full = full.merge(final_neo[['student', 'neo_n', 'neo_e', 'neo_o', 'neo_a', 'neo_c']], on='student', how='left')

In [545]:
full = full.merge(allRSQ[['recipientlastname', 'recipientfirstname', 'rsq_total']], on=['recipientlastname', 'recipientfirstname'], how='left')

In [546]:
full = full.merge(tmas[['recipientlastname', 'recipientfirstname', 'tmas_total']], on=['recipientlastname', 'recipientfirstname'], how='outer')

In [547]:
full = full.merge(tse[['recipientlastname', 'recipientfirstname', 'tses_se', 'tses_is', 'tses_cm','tses_total']], on=['recipientlastname', 'recipientfirstname'], how='outer')

In [548]:
full['name'] = full['recipientlastname'] + "," + full['recipientfirstname']

In [549]:
full.head(1)

,student,ytrt_total,recipientlastname,recipientfirstname,crtse_total,das_depression,das_anxiety,das_stress,ccs_gpa,partch,...,neo_o,neo_a,neo_c,rsq_total,tmas_total,tses_se,tses_is,tses_cm,tses_total,name
0,2561224.0,4.6,Kim,Yewon,87.888889,1.0,1.0,1.428571,3.4,4,...,4.666667,3.916667,4.083333,2.470588,4.647059,8.125,8.25,8.0,8.125,"Kim,Yewon"

### Merging with contact info to get emails and filling in blank emails

In [550]:
final = full.merge(contact[['student', 'email']], on='student', how='outer')

In [551]:
final.loc[final.student==1382103,"email"] = 'set9x@virginia.edu'
final.loc[final.student==1498517,"email"] = "sem4u@virginia.edu"
final.loc[final.student==2176293,"email"] = "amh3ej@virginia.edu"
final.loc[final.student==2200476,"email"] = "mih3f@virginia.edu"
final.loc[final.student==2437606,"email"] = "ckb4y@virginia.edu"
final.loc[final.student==2468766,"email"] = "npg7wf@virginia.edu"
final.loc[final.student==2498051,"email"] = "hjk9dr@virginia.edu"
final.loc[final.student==2502859,"email"] = "cjt4te@virginia.edu"
final.loc[final.student==2571818,"email"] = "hwr9ex@virginia.edu"
final.loc[final.student==2605170,"email"] = "rml3x@virginia.edu"
final.loc[final.student==2699159,"email"] = "esw4au@virginia.edu"
final.loc[final.student==2699239,"email"] = "rb2rf@virginia.edu"
final.loc[final.student==2699474,"email"] = "smj6t@virginia.edu"
final.loc[final.student==2704548,"email"] = "hw8kw@virginia.edu"
final.loc[final.student==2732302,"email"] = "hlh9j@virginia.edu"
final.loc[final.student==2732372,"email"] = "cml2zq@virginia.edu"
final.loc[final.student==2744059,"email"] = "amh9gu@virginia.edu"
final.loc[final.student==2745617,"email"] = "mca5hu@virginia.edu"
final.loc[final.student==2747552,"email"] = "leo9um@virginia.edu"
final.loc[final.student==2760226,"email"] = "ncb8q@virginia.edu"
final.loc[final.student==2761355,"email"] = "joh2va@virginia.edu"
final.loc[final.student==2762920,"email"] = "bfd8er@virginia.edu"
final.loc[final.student==2766444,"email"] = "lck4hk@virginia.edu"
final.loc[final.student==2767343,"email"] = "kno9b@virginia.edu"
final.loc[final.student==2767980,"email"] = "oce7ph@virginia.edu"
final.loc[final.student==2772863,"email"] = "es8fa@virginia.edu"
final.loc[final.student==2775384,"email"] = "cc3vm@virginia.edu"

In [552]:
final.head(1)

,student,ytrt_total,recipientlastname,recipientfirstname,crtse_total,das_depression,das_anxiety,das_stress,ccs_gpa,partch,...,neo_a,neo_c,rsq_total,tmas_total,tses_se,tses_is,tses_cm,tses_total,name,email
0,2561224.0,4.6,Kim,Yewon,87.888889,1.0,1.0,1.428571,3.4,4,...,3.916667,4.083333,2.470588,4.647059,8.125,8.25,8.0,8.125,"Kim,Yewon",yk5kb@virginia.edu

## Step 2: Cleaning Data

In [553]:
final = destring(final, included=['age'])

In [556]:
replace_map = {
    2:1, 3:1, 4:1, 5:1, 1:0
}

final["age_21ab"] = final["age"].replace(replace_map)

## not sure what is happeing with the tab, gen() looks like dummy encoding?

tab hsloc, gen(hsloc_)
tab hsses, gen(hsses_)
tab hsrace, gen(hsrace_)
tab hsach, gen(hsach_)

In [560]:
replace_map = {
    "2,5":2, "3,5":3
}

final.race = final.race.replace(replace_map)

In [562]:
final = destring(final, included=['race'])

In [564]:
replace_map = {5:1, 2:0, 3:0, 4:0, 1:0}
final["race_white"] = final.race.replace(replace_map)

In [569]:
replace_map = {1:0, np.NaN:1}
final["race_white_miss"] = final.race_white.replace(replace_map)

In [571]:
final = destring(final, included=['hsses', 'hsach'])

In [575]:
replace_map = {1:0, 2:0, 3:0, np.NaN:1}
final["hsses_miss"] = final.hsses.replace(replace_map)

In [578]:
replace_map = {1:0, 2:0, 3:0, np.NaN:1}
final["hsach_miss"] = final.hsach.replace(replace_map)

In [580]:
final = destring(final, included=['partch'])

In [582]:
replace_map = {1:1, 2:1, 3:1, 4:0}
final["partch_either"] = final.partch.replace(replace_map)

In [584]:
final = destring(final, included=['moedu', 'faedu'])

In [586]:
replace_map = {3:1, 4:1, 5:1, 2:0, 1:0}
final["moedu_colab"] = final.moedu.replace(replace_map)

In [589]:
replace_map = {3:1, 4:1, 5:1, 2:0, 1:0}
final["faedu_colab"] = final.faedu.replace(replace_map)

In [592]:
final.gender = final.gender.str.strip().str.lower()

In [595]:
replace_map = {'female':1, 'woman':1, 'male':0, 'm':0}
final["gender_female"] = final.gender.replace(replace_map)

In [597]:
replace_map = {np.NaN:1, 1:0, 0:0}
final["gender_female_miss"] = final.gender_female.replace(replace_map)

In [599]:
replace_map = {"3.6??":"3.6"}
final["ccs_gpa"] = final.ccs_gpa.replace(replace_map)

In [600]:
final = destring(final, included=['ccs_gpa'])

In [609]:
final

,student,ytrt_total,recipientlastname,recipientfirstname,crtse_total,das_depression,das_anxiety,das_stress,ccs_gpa,partch,...,age_21ab,race_white,race_white_miss,hsses_miss,hsach_miss,partch_either,moedu_colab,faedu_colab,gender_female,gender_female_miss
0,2561224.0,4.6,Kim,Yewon,87.888889,1.000000,1.000000,1.428571,3.40,4.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1.0,0.0
1,2273117.0,6.4,Alba,Elena,61.481481,0.142857,0.142857,0.857143,3.86,1.0,...,1.0,1.0,0.0,0.0,0.0,1.0,1.0,0.0,1.0,0.0
2,2539029.0,6.6,All,Hannah,77.407407,0.285714,0.142857,1.000000,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,NaN,NaN,NaN,NaN,1.0
3,2745617.0,5.6,Appleton,Megan,44.222222,0.428571,0.714286,0.714286,3.99,4.0,...,1.0,1.0,0.0,0.0,0.0,0.0,1.0,1.0,1.0,0.0
4,2542858.0,6.0,Atkeson,Katherine,80.740741,0.285714,0.142857,0.571429,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,NaN,NaN,NaN,NaN,1.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
113,2592977.0,5.8,Xin,Christie,76.185185,0.142857,0.000000,0.000000,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,NaN,NaN,NaN,NaN,1.0
114,2524000.0,6.8,Yancey,Katherine,26.592593,0.142857,0.428571,0.857143,3.60,4.0,...,1.0,1.0,0.0,0.0,0.0,0.0,1.0,1.0,1.0,0.0
115,2543571.0,7.0,Yang,Hannah,94.740741,0.000000,0.000000,0.142857,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,NaN,NaN,NaN,NaN,1.0
116,2534432.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,NaN,NaN,NaN,NaN,1.0
117,2703418.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,1.0,1.0,1.0,NaN,NaN,NaN,NaN,1.0

## Merge with Randomized Information

In [601]:
rand = pd.read_excel("SimTeacher Randomization Fall 2018 Spring 2019.xlsx")

In [607]:
rand = rand.rename({'Email':'email'}, axis=1)

In [608]:
full = final.merge(rand, on='email', how='outer')

In [610]:
full

,student,ytrt_total,recipientlastname,recipientfirstname,crtse_total,das_depression,das_anxiety,das_stress,ccs_gpa,partch,...,rannum,temp,numofstudents,tr_n,ra,Fall 2018 Coaching RA,Fall 2018 Race RA,Fall 2018 Coaching notes,Spring 2019 Coaching RA,Spring 2019 Race RA
0,2561224.0,4.6,Kim,Yewon,87.888889,1.000000,1.000000,1.428571,3.40,4.0,...,0.958017,33.0,33.0,8.0,TW,Coaching,White,Coaching conversation,No Coaching,White
1,2273117.0,6.4,Alba,Elena,61.481481,0.142857,0.142857,0.857143,3.86,1.0,...,0.730109,25.0,33.0,8.0,TW,Coaching,White,No notes,No Coaching,Black
2,2539029.0,6.6,All,Hannah,77.407407,0.285714,0.142857,1.000000,NaN,NaN,...,0.230620,8.0,39.0,10.0,CB,No Coaching,Black,No coaching conversation,Coaching,White
3,2745617.0,5.6,Appleton,Megan,44.222222,0.428571,0.714286,0.714286,3.99,4.0,...,0.213969,9.0,36.0,9.0,CB,No Coaching,Black,No coaching conversation,Coaching,White
4,2542858.0,6.0,Atkeson,Katherine,80.740741,0.285714,0.142857,0.571429,NaN,NaN,...,0.594512,22.0,39.0,10.0,TB,Coaching,Black,Coaching conversation,No Coaching,Black
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
115,2543571.0,7.0,Yang,Hannah,94.740741,0.000000,0.000000,0.142857,NaN,NaN,...,0.301566,12.0,39.0,10.0,CW,No Coaching,White,No coaching conversation,Coaching,White
116,2534432.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.733051,26.0,36.0,9.0,TB,Coaching,Black,Coaching conversation,No Coaching,White
117,2703418.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
118,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.925287,30.0,33.0,8.0,TW,Coaching,White,No notes,No Coaching,Black
119,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,...,0.701000,25.0,39.0,10.0,TB,Coaching,Black,No notes,Coaching,Black